app/views/recipes/_comments.html.haml

%p.close_comments close[x]
- @recipe.comments.reverse_order.each do |com|
---
SELECT "comments".* FROM "comments"  WHERE "comments"."recipe_id" = $1  ORDER BY created_at ASC  [["recipe_id", 5]]