app/views/recipes/show.js.erb


console.log('comments num: '+'<%=@recipe.comments.count%>')
---
SELECT "comments".* FROM "comments"  WHERE "comments"."recipe_id" = $1  ORDER BY created_at ASC  [["recipe_id", 1]]