app/views/recipes/show.html.haml

SELECT "comments".* FROM "comments"  WHERE "comments"."recipe_id" = 5  ORDER BY created_at ASC
---
  %h2 Comments
  - @recipe.comments.reverse_order.each do |com|