app/controllers/comments_controller.rb

SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "recipes" SET "commented" = $1, "updated_at" = $2 WHERE "recipes"."id" = 5  [["commented", "yes"], ["updated_at", "2014-06-16 15:15:42.830219"]]
INSERT INTO "comments" ("comment", "created_at", "recipe_id", "updated_at", "user_id", "user_image", "username") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    recipe = Recipe.find(params[:recipe_id])
    comment = recipe.comments.build(comment_params)
    Recipe.find(params[:recipe_id]).update_attributes(:commented => 'yes')
    comment.user = current_user
    if comment.save