app/controllers/fav_recipes_controller.rb

  def index
    @recipes = FavRecipe.all.order("id asc")
---
SELECT "fav_recipes".* FROM "fav_recipes"   ORDER BY id asc

  def show
    @recipe = FavRecipe.find_by_id(params[:id])
    if Comment.all.where(:recipe_id => params[:id])[-1] == nil
---
SELECT  "fav_recipes".* FROM "fav_recipes"  WHERE "fav_recipes"."id" = 1 LIMIT 1
SELECT "comments".* FROM "comments"  WHERE "comments"."recipe_id" = 1  ORDER BY created_at ASC

  def create
    @recipe = FavRecipe.new(recipe_params)
    if @recipe.save
---
INSERT INTO "fav_recipes" ("created_at", "description", "image", "ingredients", "preparation", "ready_in", "recipe_name", "tags", "updated_at", "user") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def edit
    @recipe = FavRecipe.find_by_id(params[:id])
---
SELECT  "fav_recipes".* FROM "fav_recipes"  WHERE "fav_recipes"."id" = 1 LIMIT 1

  def update
    @recipe = FavRecipe.find(params[:id])
    if @recipe.update_attributes(recipe_params)
---
SELECT  "fav_recipes".* FROM "fav_recipes"  WHERE "fav_recipes"."id" = $1 LIMIT 1  [["id", 1]]
UPDATE "fav_recipes" SET "ingredients" = $1, "updated_at" = $2 WHERE "fav_recipes"."id" = 1  [["ingredients", "- stuff\r\n-stuff\r\n-stuff\r\n- more stuff"], ["updated_at", "2014-06-18 16:39:34.263015"]]