app/controllers/recipes_controller.rb

  def index
    @recipes = Recipe.all.order("id asc")
---
SELECT "recipes".* FROM "recipes"   ORDER BY id asc

  def my_recipes
    @recipes = Recipe.all.where(:user => params[:user]).order("id asc")
---
SELECT "recipes".* FROM "recipes"  WHERE "recipes"."user" = 'giova'  ORDER BY id asc

  def comments
    @comments = Comment.all.where(:recipe_id => params[:id])
---
SELECT "comments".* FROM "comments"  WHERE "comments"."recipe_id" = 6  ORDER BY created_at ASC

  def show
    @recipe = Recipe.find_by_id(params[:id])
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = 1 LIMIT 1

  def create
    @recipe = Recipe.new(recipe_params)
    if @recipe.save
---
INSERT INTO "recipes" ("created_at", "description", "ingredients", "preparation", "ready_in", "recipe_name", "servings", "tags", "updated_at", "user") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def edit
    @recipe = Recipe.find_by_id(params[:id])
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = 1 LIMIT 1

  def update
    @recipe = Recipe.find(params[:id])
    if @recipe.update_attributes(recipe_params)
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = 2 LIMIT 1
UPDATE "recipes" SET "ingredients" = $1, "ready_in" = $2, "recipe_name" = $3, "servings" = $4, "updated_at" = $5 WHERE "recipes"."id" = 54  [["ingredients", "put some pudding on your banana"], ["ready_in", "30 min"], ["recipe_name", "banana pudding"], ["servings", 3], ["updated_at", "2014-06-17 19:09:45.755787"]]

  def add_to_fav
    recipe = Recipe.find_by_id(params[:id]).update_attributes(:favorite => "yes")
    @recipe = Recipe.find_by_id(params[:id])
    @image = Recipe.find_by_id(params[:id]).image
    fav_recipe = FavRecipe.create
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = 14 LIMIT 1
UPDATE "fav_recipes" SET "updated_at" = $1, "user" = $2 WHERE "fav_recipes"."id" = 3  [["updated_at", "2014-06-18 20:49:43.848012"], ["user", "giova"]]
UPDATE "recipes" SET "favorite" = $1, "updated_at" = $2 WHERE "recipes"."id" = 14  [["favorite", "yes"], ["updated_at", "2014-06-18 01:55:22.931660"]]
INSERT INTO "fav_recipes" ("created_at", "updated_at") VALUES ($1, $2) RETURNING "id"  [["created_at", "2014-06-18 20:49:43.840156"], ["updated_at", "2014-06-18 20:49:43.840156"]]

  def remove_from_fav
    recipe = Recipe.find_by_id(params[:id]).update_attributes(:favorite => "no")
    fav_recipe = FavRecipe.where(:id => params[:id], :user => params[:username])[0]
    fav_recipe.destroy
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = 5 LIMIT 1
UPDATE "recipes" SET "favorite" = $1, "updated_at" = $2 WHERE "recipes"."id" = 5  [["favorite", "no"], ["updated_at", "2014-06-18 03:55:27.423644"]]
SELECT  "fav_recipes".* FROM "fav_recipes"  WHERE "fav_recipes"."id" = 22 AND "fav_recipes"."user" = 'giova' LIMIT 1
SELECT  "users".* FROM "users"  WHERE "users"."id" = 1  ORDER BY "users"."id" ASC LIMIT 1
DELETE FROM "fav_recipes" WHERE "fav_recipes"."id" = $1  [["id", 22]]

  def delete
    @recipe = Recipe.find_by_id(params[:id])
---
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = 7 LIMIT 1

  def destroy
    recipe = Recipe.find_by_id(params[:id]).destroy
---
DELETE FROM "recipes" WHERE "recipes"."id" = $1  [["id", 7]]
SELECT  "recipes".* FROM "recipes"  WHERE "recipes"."id" = 7 LIMIT 1