app/controllers/recipes_controller.rb

  def show
    @recipe = Recipe.find_by_id(params[:id])
    if Comment.all.where(:recipe_id => params[:id])[-1] == nil
---
SELECT "comments".* FROM "comments"  WHERE "comments"."recipe_id" = $1  ORDER BY created_at ASC  [["recipe_id", 1]]